Config/InformationRegisters/ДанныеРасчетовПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеРасчетовПоказателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеРасчетов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ДанныеРасчетовПоказателей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы
	
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.ДанныеРасчетовПоказателей";
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
			
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеРасчетовПоказателей.ЭкземплярОтчета КАК ЭкземплярОтчета
	|ИЗ
	|	РегистрСведений.ДанныеРасчетовПоказателей КАК ДанныеРасчетовПоказателей";	
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	Параметры.ОбработкаЗавершена = Ложь;
	 
	ПолноеИмяРегистра = "РегистрСведений.ДанныеРасчетовПоказателей";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
			
	РезультатВыборки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуИзмеренийНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь,
		ПолноеИмяРегистра,
		МенеджерВременныхТаблиц,		
		ДополнительныеПараметры);
	
	Если НЕ РезультатВыборки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	ИначеЕсли НЕ РезультатВыборки.ЕстьЗаписиВоВременнойТаблице Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременнойТаблицы = РезультатВыборки.ИмяВременнойТаблицы;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеРасчетовПоказателей.ЭкземплярОтчета КАК ЭкземплярОтчета,
		|	ПРЕДСТАВЛЕНИЕ(ДанныеРасчетовПоказателей.ЭкземплярОтчета) КАК ЭкземплярОтчетаПредставление,
		|	ДанныеРасчетовПоказателей.ДанныеРасчетов КАК ДанныеРасчетов
		|ИЗ
		|	РегистрСведений.ДанныеРасчетовПоказателей КАК ДанныеРасчетовПоказателей
		|ГДЕ
		|	ДанныеРасчетовПоказателей.ЭкземплярОтчета В
		|			(ВЫБРАТЬ
		|				ТТ.ЭкземплярОтчета
		|			ИЗ
		|				&ТТ КАК ТТ)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТТ",ИмяВременнойТаблицы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МетаданныеЭкземпляраОтчета = Метаданные.Документы.УниверсальныйРегламентированныйОтчет;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
				
			ПредставлениеОбъекта = ВыборкаДетальныеЗаписи.ЭкземплярОтчетаПредставление;
			НаборЗаписей = РегистрыСведений.ДанныеРасчетовПоказателей.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭкземплярОтчета.Установить(ВыборкаДетальныеЗаписи.ЭкземплярОтчета);
			
			Запись = НаборЗаписей.Добавить();
			Запись.ЭкземплярОтчета = ВыборкаДетальныеЗаписи.ЭкземплярОтчета;
			Попытка
				ТекДанные = ВыборкаДетальныеЗаписи.ДанныеРасчетов.Получить();
			Исключение
				ТекДанные = Неопределено;//значит битое хранилище значение, установим Неопределено	
			КонецПопытки;
			Запись.ДанныеРасчетов = Новый ХранилищеЗначения(ТекДанные,Новый СжатиеДанных(9));
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей,Истина,Ложь,Ложь);		
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать объект: %Объект% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Объект%", ПредставлениеОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
									УровеньЖурналаРегистрации.Ошибка,
									МетаданныеЭкземпляраОтчета,
									ВыборкаДетальныеЗаписи.ЭкземплярОтчета,
									ТекстСообщения);
				
		КонецПопытки;
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		//если из регистра были удалены записи, то чтобы не было зацикливания, отметим, что обработка выполнена
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТТ.ЭкземплярОтчета
			|ИЗ
			|	&ТТ КАК ТТ";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТТ",ИмяВременнойТаблицы);
		
		ТаблицаДанных = Запрос.Выполнить().Выгрузить();
		ДопПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
		ДопПараметры.ЭтоНезависимыйРегистрСведений = Истина;
		ДопПараметры.ПолноеИмяРегистра = "РегистрСведений.ДанныеРасчетовПоказателей";
	
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ТаблицаДанных,ДопПараметры,Параметры.Очередь);
		
	КонецЕсли;
			
	Параметры.ОбработкаЗавершена = НЕ ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь,
		ПолноеИмяРегистра);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
